loliweive/stm32-oop/src/display/ssd1306.c
/**
 * @file    ssd1306.c
 * @brief   SSD1306 OLED 128x64 I2C 驱动实现 — OOP vtable 模式
 *
 * 实现 OledDisplay 接口的所有方法：
 *   - 硬件控制：init, clear, flush, flush_area, reverse
 *   - 像素操作：draw_point, get_point
 *   - 几何绘图：draw_line, draw_rect, draw_triangle,
 *               draw_circle, draw_ellipse, draw_arc
 *   - 文本显示：show_char, show_string, show_num, show_hex, show_bin,
 *               show_float, show_image, printf
 *
 * 移植自江协科技 OLED 驱动 V2.0，重构为 OOP vtable 模式。
 */

#include "ssd1306.h"
#include "oled_data.h"
#include <string.h>
#include <math.h>
#include <stdio.h>
#include <stdarg.h>

/* ── 目标硬件 I2C 寄存器操作 ────────────────────────── */
#ifdef STM32F103xB
#include "stm32f103xb.h"

/**
 * @brief 低层 I2C 写 (绕过 I2cPort 封装，直接操作寄存器)
 *
 * 用于 OLED 数据批量传输，避免 I2cPort 的每次分帧开销。
 * SSD1306 每页刷新需要一次发送 129 字节 (控制字节+128数据)，
 * 直接寄存器操作显著减少 CPU 开销。
 */
/* I2C 总线恢复 — 外设复位 + STOP，解锁被从机拉死的总线 */
static void _i2c_recover(I2C_Type *i)
{
    i->CR1 |= I2C_CR1_STOP;       /* 确保 STOP */
    i->CR1 |= I2C_CR1_SWRST;      /* 软件复位 I2C 外设 */
    i->CR1 &= ~I2C_CR1_SWRST;     /* 解除复位 */
}

static bool i2c_write_raw(void *i2c, uint8_t addr, const uint8_t *data, size_t len)
{
    I2C_Type *i = (I2C_Type *)i2c;
    uint32_t to;

    /* 等待总线空闲 */
    to = 100000;
    while ((i->SR2 & I2C_SR2_BUSY) && --to) {}
    if (!to) { _i2c_recover(i); return false; }

    /* START */
    i->CR1 |= I2C_CR1_START;
    to = 100000;
    while (!(i->SR1 & I2C_SR1_SB) && --to) {}
    if (!to) { _i2c_recover(i); return false; }

    /* ADDR (write) */
    i->DR = (uint8_t)(addr << 1);
    to = 100000;
    while (!(i->SR1 & (I2C_SR1_ADDR | I2C_SR1_AF)) && --to) {}
    if (!to || (i->SR1 & I2C_SR1_AF)) {
        (void)i->SR2;
        _i2c_recover(i);
        return false;
    }
    (void)i->SR2; /* clear ADDR */

    /* DATA */
    for (size_t n = 0; n < len; n++) {
        to = 100000;
        while (!(i->SR1 & I2C_SR1_TXE) && --to) {}
        if (!to) { _i2c_recover(i); return false; }
        i->DR = data[n];
    }

    /* 等待 BTF (字节传输完成) */
    to = 100000;
    while (!(i->SR1 & I2C_SR1_BTF) && --to) {}

    /* STOP */
    i->CR1 |= I2C_CR1_STOP;
    return true;
}

#else /* HOST_TEST — mock 实现 */

#include <stdbool.h>
static bool i2c_write_raw(void *i2c, uint8_t addr, const uint8_t *data, size_t len)
{
    (void)i2c; (void)addr; (void)data; (void)len;
    return true; /* host 测试中无真实 I2C */
}
#endif /* STM32F103xB */

/* ── 前向声明 (vtable 函数) ──────────────────────────── */
static void _ssd1306_init(OledDisplay *self);
static void _ssd1306_clear(OledDisplay *self);
static void _ssd1306_flush(OledDisplay *self);
static void _ssd1306_flush_area(OledDisplay *self, int16_t x, int16_t y,
                                uint8_t w, uint8_t h);
static void _ssd1306_reverse(OledDisplay *self);
static void _ssd1306_reverse_area(OledDisplay *self, int16_t x, int16_t y,
                                  uint8_t w, uint8_t h);
static void _ssd1306_draw_point(OledDisplay *self, int16_t x, int16_t y);
static uint8_t _ssd1306_get_point(OledDisplay *self, int16_t x, int16_t y);
static void _ssd1306_draw_line(OledDisplay *self, int16_t x0, int16_t y0,
                               int16_t x1, int16_t y1);
static void _ssd1306_draw_rect(OledDisplay *self, int16_t x, int16_t y,
                               uint8_t w, uint8_t h, uint8_t filled);
static void _ssd1306_draw_triangle(OledDisplay *self,
                                   int16_t x0, int16_t y0, int16_t x1, int16_t y1,
                                   int16_t x2, int16_t y2, uint8_t filled);
static void _ssd1306_draw_circle(OledDisplay *self, int16_t x, int16_t y,
                                 uint8_t r, uint8_t filled);
static void _ssd1306_draw_ellipse(OledDisplay *self, int16_t x, int16_t y,
                                  uint8_t a, uint8_t b, uint8_t filled);
static void _ssd1306_draw_arc(OledDisplay *self, int16_t x, int16_t y,
                              uint8_t r, int16_t start_angle, int16_t end_angle,
                              uint8_t filled);
static void _ssd1306_show_char(OledDisplay *self, int16_t x, int16_t y,
                               char ch, uint8_t font_size);
static void _ssd1306_show_string(OledDisplay *self, int16_t x, int16_t y,
                                 const char *str, uint8_t font_size);
static void _ssd1306_show_num(OledDisplay *self, int16_t x, int16_t y,
                              uint32_t num, uint8_t len, uint8_t font_size);
static void _ssd1306_show_signed(OledDisplay *self, int16_t x, int16_t y,
                                 int32_t num, uint8_t len, uint8_t font_size);
static void _ssd1306_show_hex(OledDisplay *self, int16_t x, int16_t y,
                              uint32_t num, uint8_t len, uint8_t font_size);
static void _ssd1306_show_bin(OledDisplay *self, int16_t x, int16_t y,
                              uint32_t num, uint8_t len, uint8_t font_size);
static void _ssd1306_show_float(OledDisplay *self, int16_t x, int16_t y,
                                double num, uint8_t int_len, uint8_t frac_len,
                                uint8_t font_size);
static void _ssd1306_show_image(OledDisplay *self, int16_t x, int16_t y,
                                uint8_t w, uint8_t h, const uint8_t *img);

/* ── 工具函数 ────────────────────────────────────────── */

/** @brief 次方函数 (内部使用) */
static uint32_t oled_pow(uint32_t x, uint32_t y)
{
    uint32_t result = 1;
    while (y--) result *= x;
    return result;
}

/**
 * @brief 判断指定点是否在指定多边形内部
 * @ref   W. Randolph Franklin, https://wrfranklin.org/Research/Short_Notes/pnpoly.html
 */
static uint8_t oled_pnpoly(uint8_t nvert, int16_t *vertx, int16_t *verty,
                           int16_t testx, int16_t testy)
{
    int16_t i, j, c = 0;
    for (i = 0, j = nvert - 1; i < nvert; j = i++) {
        if (((verty[i] > testy) != (verty[j] > testy)) &&
            (testx < (vertx[j] - vertx[i]) * (testy - verty[i]) /
                      (verty[j] - verty[i]) + vertx[i])) {
            c = !c;
        }
    }
    return c;
}

/**
 * @brief 判断指定点是否在指定角度内部
 * @param start_angle 起始角度 (-180~180), 水平向右=0, 顺时针旋转
 * @param end_angle   终止角度 (-180~180)
 */
static uint8_t oled_is_in_angle(int16_t x, int16_t y,
                                int16_t start_angle, int16_t end_angle)
{
    int16_t point_angle = atan2(y, x) / 3.14 * 180;
    if (start_angle < end_angle) {
        return (point_angle >= start_angle && point_angle <= end_angle) ? 1 : 0;
    } else {
        return (point_angle >= start_angle || point_angle <= end_angle) ? 1 : 0;
    }
}

/* ── 辅助: 获取 SSD1306 指针 ─────────────────────────── */
static inline SSD1306 *_ssd(OledDisplay *self) {
    return (SSD1306 *)self;
}

/* ── 低层 I2C 发送 ───────────────────────────────────── */

