loliweive/stm32-oop/src/display/ssd1306.c
/** @brief 发送命令字节 */
static void _send_cmd(SSD1306 *oled, uint8_t cmd)
{
    uint8_t buf[2] = {0x00, cmd}; /* Co=0, D/C#=0 → 命令 */
    i2c_write_raw(oled->i2c, oled->addr, buf, 2);
}

/** @brief 发送数据块 (控制字节 0x40 = 数据模式) */
static void _send_data(SSD1306 *oled, const uint8_t *data, size_t len)
{
    for (size_t i = 0; i < len; i += 128) {
        size_t chunk = (len - i > 128) ? 128 : (len - i);
        uint8_t buf[129];
        buf[0] = 0x40; /* Co=0, D/C#=1 → 数据 */
        memcpy(buf + 1, data + i, chunk);
        i2c_write_raw(oled->i2c, oled->addr, buf, chunk + 1);
    }
}

/** @brief 设置光标位置 (页地址 + 列地址) */
static void _set_cursor(SSD1306 *oled, uint8_t page, uint8_t col)
{
    _send_cmd(oled, 0xB0 | page);                    /* 页地址 */
    _send_cmd(oled, 0x10 | ((col & 0xF0) >> 4));     /* 列地址高4位 */
    _send_cmd(oled, 0x00 | (col & 0x0F));             /* 列地址低4位 */
}

/* ═══════════════════════════════════════════════════════
 * vtable 实现
 * ═══════════════════════════════════════════════════════ */

/* ── 硬件控制 ────────────────────────────────────────── */

static void _ssd1306_init(OledDisplay *self)
{
    SSD1306 *oled = _ssd(self);

    /* SSD1306 初始化序列 (Display OFF 状态下配置) */
    uint8_t init_cmds[] = {
        0xAE,        /* Display OFF */
        0x20, 0x02,  /* 内存寻址模式 → Page Addressing */
        0xD5, 0x80,  /* 设置显示时钟分频比/振荡器频率 */
        0xA8, 0x3F,  /* 设置多路复用率 (64) */
        0xD3, 0x00,  /* 设置显示偏移 */
        0x40,        /* 设置显示开始行 */
        0xA1,        /* 设置左右方向 (正常) */
        0xC8,        /* 设置上下方向 (正常) */
        0xDA, 0x12,  /* 设置 COM 引脚硬件配置 */
        0x81, 0xCF,  /* 设置对比度 */
        0xD9, 0xF1,  /* 设置预充电周期 */
        0xDB, 0x30,  /* 设置 VCOMH 取消选择级别 */
        0xA4,        /* 整个显示打开/关闭 (正常) */
        0xA6,        /* 设置正常/反色显示 (正常) */
        0x8D, 0x14,  /* 设置充电泵 (启用) */
    };
    for (size_t i = 0; i < sizeof(init_cmds); i++) {
        _send_cmd(oled, init_cmds[i]);
    }

    /* 先清空 GRAM (显示仍为 OFF, 无闪烁) */
    memset(oled->framebuf, 0, sizeof(oled->framebuf));
    _ssd1306_flush(self);

    /* 最后开显示 — 此时 GRAM 已全零, 纯黑屏 */
    _send_cmd(oled, 0xAF);
}

static void _ssd1306_clear(OledDisplay *self)
{
    SSD1306 *oled = _ssd(self);
    memset(oled->framebuf, 0, sizeof(oled->framebuf));
}

static void _ssd1306_flush(OledDisplay *self)
{
    SSD1306 *oled = _ssd(self);
    for (uint8_t j = 0; j < SSD1306_PAGES; j++) {
        _set_cursor(oled, j, 0);
        _send_data(oled, oled->framebuf[j], SSD1306_WIDTH);
    }
}

static void _ssd1306_flush_area(OledDisplay *self, int16_t x, int16_t y,
                                uint8_t width, uint8_t height)
{
    SSD1306 *oled = _ssd(self);
    int16_t page, page1;

    page  = y / 8;
    page1 = (y + height - 1) / 8 + 1;
    if (y < 0) { page -= 1; page1 -= 1; }

    for (int16_t j = page; j < page1; j++) {
        if (x >= 0 && x <= 127 && j >= 0 && j <= 7) {
            _set_cursor(oled, (uint8_t)j, (uint8_t)x);
            _send_data(oled, &oled->framebuf[j][x], width);
        }
    }
}

static void _ssd1306_reverse(OledDisplay *self)
{
    SSD1306 *oled = _ssd(self);
    for (uint8_t j = 0; j < SSD1306_PAGES; j++) {
        for (uint8_t i = 0; i < SSD1306_WIDTH; i++) {
            oled->framebuf[j][i] ^= 0xFF;
        }
    }
}

static void _ssd1306_reverse_area(OledDisplay *self, int16_t x, int16_t y,
                                  uint8_t width, uint8_t height)
{
    SSD1306 *oled = _ssd(self);
    for (int16_t j = y; j < y + height; j++) {
        for (int16_t i = x; i < x + width; i++) {
            if (i >= 0 && i <= 127 && j >= 0 && j <= 63) {
                oled->framebuf[j / 8][i] ^= (0x01 << (j % 8));
            }
        }
    }
}

/* ── 像素操作 ────────────────────────────────────────── */

static void _ssd1306_draw_point(OledDisplay *self, int16_t x, int16_t y)
{
    SSD1306 *oled = _ssd(self);
    if (x >= 0 && x <= 127 && y >= 0 && y <= 63) {
        oled->framebuf[y / 8][x] |= (0x01 << (y % 8));
    }
}

static uint8_t _ssd1306_get_point(OledDisplay *self, int16_t x, int16_t y)
{
    SSD1306 *oled = _ssd(self);
    if (x >= 0 && x <= 127 && y >= 0 && y <= 63) {
        if (oled->framebuf[y / 8][x] & (0x01 << (y % 8))) return 1;
    }
    return 0;
}

/* ── 几何绘图 ────────────────────────────────────────── */

static void _ssd1306_draw_line(OledDisplay *self,
                               int16_t x0, int16_t y0,
                               int16_t x1, int16_t y1)
{
    int16_t x, y, dx, dy, d, incrE, incrNE, temp;
    uint8_t yflag = 0, xyflag = 0;

    if (y0 == y1) {
        /* 横线 */
        if (x0 > x1) { temp = x0; x0 = x1; x1 = temp; }
        for (x = x0; x <= x1; x++) _ssd1306_draw_point(self, x, y0);
        return;
    }
    if (x0 == x1) {
        /* 竖线 */
        if (y0 > y1) { temp = y0; y0 = y1; y1 = temp; }
        for (y = y0; y <= y1; y++) _ssd1306_draw_point(self, x0, y);
        return;
    }

    /* Bresenham 算法画斜线 */
    if (x0 > x1) {
        temp = x0; x0 = x1; x1 = temp;
        temp = y0; y0 = y1; y1 = temp;
    }

    if (y0 > y1) {
        y0 = -y0; y1 = -y1;
        yflag = 1;
    }

    if (y1 - y0 > x1 - x0) {
        temp = x0; x0 = y0; y0 = temp;
        temp = x1; x1 = y1; y1 = temp;
        xyflag = 1;
    }

    dx = x1 - x0;
    dy = y1 - y0;
    incrE = 2 * dy;
    incrNE = 2 * (dy - dx);
    d = 2 * dy - dx;
    x = x0; y = y0;

    /* 画起始点 */
    if (yflag && xyflag)      _ssd1306_draw_point(self, y, -x);
    else if (yflag)           _ssd1306_draw_point(self, x, -y);
    else if (xyflag)           _ssd1306_draw_point(self, y, x);
    else                       _ssd1306_draw_point(self, x, y);

    while (x < x1) {
        x++;
        if (d < 0) { d += incrE; }
        else       { y++; d += incrNE; }

        if (yflag && xyflag)      _ssd1306_draw_point(self, y, -x);
        else if (yflag)           _ssd1306_draw_point(self, x, -y);
        else if (xyflag)           _ssd1306_draw_point(self, y, x);
        else                       _ssd1306_draw_point(self, x, y);
    }
}

static void _ssd1306_draw_rect(OledDisplay *self, int16_t x, int16_t y,
                               uint8_t width, uint8_t height, uint8_t filled)
{
    if (!filled) {
        for (int16_t i = x; i < x + width; i++) {
            _ssd1306_draw_point(self, i, y);
            _ssd1306_draw_point(self, i, y + height - 1);
        }
        for (int16_t i = y; i < y + height; i++) {
            _ssd1306_draw_point(self, x, i);
            _ssd1306_draw_point(self, x + width - 1, i);
        }
    } else {
        for (int16_t i = x; i < x + width; i++) {
            for (int16_t j = y; j < y + height; j++) {
                _ssd1306_draw_point(self, i, j);
            }
        }
    }
}

static void _ssd1306_draw_triangle(OledDisplay *self,
                                   int16_t x0, int16_t y0,
                                   int16_t x1, int16_t y1,
                                   int16_t x2, int16_t y2, uint8_t filled)
{
    int16_t vx[] = {x0, x1, x2};
    int16_t vy[] = {y0, y1, y2};

    if (!filled) {
        _ssd1306_draw_line(self, x0, y0, x1, y1);
        _ssd1306_draw_line(self, x0, y0, x2, y2);
        _ssd1306_draw_line(self, x1, y1, x2, y2);
    } else {
        int16_t minx = x0, miny = y0, maxx = x0, maxy = y0;
        if (x1 < minx) minx = x1;
        if (x2 < minx) minx = x2;
        if (y1 < miny) miny = y1;
        if (y2 < miny) miny = y2;
        if (x1 > maxx) maxx = x1;
        if (x2 > maxx) maxx = x2;
        if (y1 > maxy) maxy = y1;
        if (y2 > maxy) maxy = y2;

        for (int16_t i = minx; i <= maxx; i++) {
            for (int16_t j = miny; j <= maxy; j++) {
                if (oled_pnpoly(3, vx, vy, i, j)) {
                    _ssd1306_draw_point(self, i, j);
                }
            }
        }
    }
}

