loliweive/stm32-oop/src/display/ssd1306.c
static void _ssd1306_draw_circle(OledDisplay *self, int16_t x, int16_t y,
                                 uint8_t radius, uint8_t filled)
{
    int16_t cx = 0, cy = radius;
    int16_t d = 1 - radius;

    /* 八分之一圆弧起始点 */
    _ssd1306_draw_point(self, x + cx, y + cy);
    _ssd1306_draw_point(self, x - cx, y - cy);
    _ssd1306_draw_point(self, x + cy, y + cx);
    _ssd1306_draw_point(self, x - cy, y - cx);

    if (filled) {
        for (int16_t j = -cy; j < cy; j++) {
            _ssd1306_draw_point(self, x, y + j);
        }
    }

    while (cx < cy) {
        cx++;
        if (d < 0) { d += 2 * cx + 1; }
        else       { cy--; d += 2 * (cx - cy) + 1; }

        /* 每个八分之一圆弧 */
        _ssd1306_draw_point(self, x + cx, y + cy);
        _ssd1306_draw_point(self, x + cy, y + cx);
        _ssd1306_draw_point(self, x - cx, y - cy);
        _ssd1306_draw_point(self, x - cy, y - cx);
        _ssd1306_draw_point(self, x + cx, y - cy);
        _ssd1306_draw_point(self, x + cy, y - cx);
        _ssd1306_draw_point(self, x - cx, y + cy);
        _ssd1306_draw_point(self, x - cy, y + cx);

        if (filled) {
            for (int16_t j = -cy; j < cy; j++) {
                _ssd1306_draw_point(self, x + cx, y + j);
                _ssd1306_draw_point(self, x - cx, y + j);
            }
            for (int16_t j = -cx; j < cx; j++) {
                _ssd1306_draw_point(self, x - cy, y + j);
                _ssd1306_draw_point(self, x + cy, y + j);
            }
        }
    }
}

static void _ssd1306_draw_ellipse(OledDisplay *self, int16_t x, int16_t y,
                                  uint8_t a, uint8_t b, uint8_t filled)
{
    int16_t cx = 0, cy = b;
    int16_t ai = a, bi = b;
    float d1, d2;

    if (filled) {
        for (int16_t j = -cy; j < cy; j++) {
            _ssd1306_draw_point(self, x, y + j);
        }
    }

    _ssd1306_draw_point(self, x + cx, y + cy);
    _ssd1306_draw_point(self, x - cx, y - cy);
    _ssd1306_draw_point(self, x - cx, y + cy);
    _ssd1306_draw_point(self, x + cx, y - cy);

    d1 = bi * bi + ai * ai * (-bi + 0.5f);

    /* 椭圆中间部分 */
    while (bi * bi * (cx + 1) < ai * ai * (cy - 0.5f)) {
        if (d1 <= 0) { d1 += bi * bi * (2 * cx + 3); }
        else         { d1 += bi * bi * (2 * cx + 3) + ai * ai * (-2 * cy + 2); cy--; }
        cx++;

        if (filled) {
            for (int16_t j = -cy; j < cy; j++) {
                _ssd1306_draw_point(self, x + cx, y + j);
                _ssd1306_draw_point(self, x - cx, y + j);
            }
        }

        _ssd1306_draw_point(self, x + cx, y + cy);
        _ssd1306_draw_point(self, x - cx, y - cy);
        _ssd1306_draw_point(self, x - cx, y + cy);
        _ssd1306_draw_point(self, x + cx, y - cy);
    }

    /* 椭圆两侧部分 */
    d2 = bi * bi * (cx + 0.5f) * (cx + 0.5f)
       + ai * ai * (cy - 1) * (cy - 1) - ai * ai * bi * bi;

    while (cy > 0) {
        if (d2 <= 0) { d2 += bi * bi * (2 * cx + 2) + ai * ai * (-2 * cy + 3); cx++; }
        else         { d2 += ai * ai * (-2 * cy + 3); }
        cy--;

        if (filled) {
            for (int16_t j = -cy; j < cy; j++) {
                _ssd1306_draw_point(self, x + cx, y + j);
                _ssd1306_draw_point(self, x - cx, y + j);
            }
        }

        _ssd1306_draw_point(self, x + cx, y + cy);
        _ssd1306_draw_point(self, x - cx, y - cy);
        _ssd1306_draw_point(self, x - cx, y + cy);
        _ssd1306_draw_point(self, x + cx, y - cy);
    }
}

static void _ssd1306_draw_arc(OledDisplay *self, int16_t x, int16_t y,
                              uint8_t radius, int16_t start_angle, int16_t end_angle,
                              uint8_t filled)
{
    int16_t cx = 0, cy = radius;
    int16_t d = 1 - radius;

    if (oled_is_in_angle(cx, cy, start_angle, end_angle))
        _ssd1306_draw_point(self, x + cx, y + cy);
    if (oled_is_in_angle(-cx, -cy, start_angle, end_angle))
        _ssd1306_draw_point(self, x - cx, y - cy);
    if (oled_is_in_angle(cy, cx, start_angle, end_angle))
        _ssd1306_draw_point(self, x + cy, y + cx);
    if (oled_is_in_angle(-cy, -cx, start_angle, end_angle))
        _ssd1306_draw_point(self, x - cy, y - cx);

    if (filled) {
        for (int16_t j = -cy; j < cy; j++) {
            if (oled_is_in_angle(0, j, start_angle, end_angle))
                _ssd1306_draw_point(self, x, y + j);
        }
    }

    while (cx < cy) {
        cx++;
        if (d < 0) { d += 2 * cx + 1; }
        else       { cy--; d += 2 * (cx - cy) + 1; }

        if (oled_is_in_angle(cx, cy, start_angle, end_angle))
            _ssd1306_draw_point(self, x + cx, y + cy);
        if (oled_is_in_angle(cy, cx, start_angle, end_angle))
            _ssd1306_draw_point(self, x + cy, y + cx);
        if (oled_is_in_angle(-cx, -cy, start_angle, end_angle))
            _ssd1306_draw_point(self, x - cx, y - cy);
        if (oled_is_in_angle(-cy, -cx, start_angle, end_angle))
            _ssd1306_draw_point(self, x - cy, y - cx);
        if (oled_is_in_angle(cx, -cy, start_angle, end_angle))
            _ssd1306_draw_point(self, x + cx, y - cy);
        if (oled_is_in_angle(cy, -cx, start_angle, end_angle))
            _ssd1306_draw_point(self, x + cy, y - cx);
        if (oled_is_in_angle(-cx, cy, start_angle, end_angle))
            _ssd1306_draw_point(self, x - cx, y + cy);
        if (oled_is_in_angle(-cy, cx, start_angle, end_angle))
            _ssd1306_draw_point(self, x - cy, y + cx);

        if (filled) {
            for (int16_t j = -cy; j < cy; j++) {
                if (oled_is_in_angle(cx, j, start_angle, end_angle))
                    _ssd1306_draw_point(self, x + cx, y + j);
                if (oled_is_in_angle(-cx, j, start_angle, end_angle))
                    _ssd1306_draw_point(self, x - cx, y + j);
            }
            for (int16_t j = -cx; j < cx; j++) {
                if (oled_is_in_angle(-cy, j, start_angle, end_angle))
                    _ssd1306_draw_point(self, x - cy, y + j);
                if (oled_is_in_angle(cy, j, start_angle, end_angle))
                    _ssd1306_draw_point(self, x + cy, y + j);
            }
        }
    }
}

/* ── 文本显示 ────────────────────────────────────────── */

static void _ssd1306_show_image(OledDisplay *self, int16_t x, int16_t y,
                                uint8_t width, uint8_t height, const uint8_t *image)
{
    SSD1306 *oled = _ssd(self);
    int16_t page, shift;

