loliweive/stm32-oop/src/display/ssd1306.c
    /* 清除目标区域 */
    for (int16_t j = y; j < y + height; j++) {
        for (int16_t i = x; i < x + width; i++) {
            if (i >= 0 && i <= 127 && j >= 0 && j <= 63) {
                oled->framebuf[j / 8][i] &= ~(0x01 << (j % 8));
            }
        }
    }

    for (uint8_t j = 0; j < (height - 1) / 8 + 1; j++) {
        for (uint8_t i = 0; i < width; i++) {
            if (x + i < 0 || x + i > 127) continue;

            page = y / 8;
            shift = y % 8;
            if (y < 0) { page -= 1; shift += 8; }

            if (page + j >= 0 && page + j <= 7) {
                oled->framebuf[page + j][x + i] |=
                    image[j * width + i] << (shift);
            }

            if (page + j + 1 >= 0 && page + j + 1 <= 7) {
                oled->framebuf[page + j + 1][x + i] |=
                    image[j * width + i] >> (8 - shift);
            }
        }
    }
}

static void _ssd1306_show_char(OledDisplay *self, int16_t x, int16_t y,
                               char ch, uint8_t font_size)
{
    if (font_size == OLED_FONT_8X16) {
        _ssd1306_show_image(self, x, y, 8, 16, OLED_F8x16[(uint8_t)ch - ' ']);
    } else if (font_size == OLED_FONT_6X8) {
        _ssd1306_show_image(self, x, y, 6, 8, OLED_F6x8[(uint8_t)ch - ' ']);
    }
}

static void _ssd1306_show_string(OledDisplay *self, int16_t x, int16_t y,
                                 const char *str, uint8_t font_size)
{
    uint16_t i = 0;
    int16_t x_offset = 0;
    char single_char[5];
    uint8_t char_len;
    uint16_t p_index;

    while (str[i] != '\0') {
#ifdef OLED_CHARSET_UTF8
        /* 提取 UTF-8 字符 */
        if ((str[i] & 0x80) == 0x00) {
            char_len = 1;
            single_char[0] = str[i++];
            single_char[1] = '\0';
        } else if ((str[i] & 0xE0) == 0xC0) {
            char_len = 2;
            single_char[0] = str[i++];
            if (str[i] == '\0') break;
            single_char[1] = str[i++];
            single_char[2] = '\0';
        } else if ((str[i] & 0xF0) == 0xE0) {
            char_len = 3;
            single_char[0] = str[i++];
            if (str[i] == '\0') break;
            single_char[1] = str[i++];
            if (str[i] == '\0') break;
            single_char[2] = str[i++];
            single_char[3] = '\0';
        } else if ((str[i] & 0xF8) == 0xF0) {
            char_len = 4;
            single_char[0] = str[i++];
            if (str[i] == '\0') break;
            single_char[1] = str[i++];
            if (str[i] == '\0') break;
            single_char[2] = str[i++];
            if (str[i] == '\0') break;
            single_char[3] = str[i++];
            single_char[4] = '\0';
        } else {
            i++; continue;
        }
#else
        /* GB2312 */
        if ((str[i] & 0x80) == 0x00) {
            char_len = 1;
            single_char[0] = str[i++];
            single_char[1] = '\0';
        } else {
            char_len = 2;
            single_char[0] = str[i++];
            if (str[i] == '\0') break;
            single_char[1] = str[i++];
            single_char[2] = '\0';
        }
#endif

        if (char_len == 1) {
            _ssd1306_show_char(self, x + x_offset, y, single_char[0], font_size);
            x_offset += font_size;
        } else {
            /* 搜索中文字模库 */
            for (p_index = 0;
                 strcmp(OLED_CF16x16[p_index].index, "") != 0;
                 p_index++) {
                if (strcmp(OLED_CF16x16[p_index].index, single_char) == 0) {
                    break;
                }
            }

            if (font_size == OLED_FONT_8X16) {
                _ssd1306_show_image(self, x + x_offset, y, 16, 16,
                                    OLED_CF16x16[p_index].data);
                x_offset += 16;
            } else if (font_size == OLED_FONT_6X8) {
                _ssd1306_show_char(self, x + x_offset, y, '?', OLED_FONT_6X8);
                x_offset += OLED_FONT_6X8;
            }
        }
    }
}

static void _ssd1306_show_num(OledDisplay *self, int16_t x, int16_t y,
                              uint32_t num, uint8_t length, uint8_t font_size)
{
    for (uint8_t i = 0; i < length; i++) {
        char digit = (char)(num / oled_pow(10, length - i - 1) % 10 + '0');
        _ssd1306_show_char(self, x + i * font_size, y, digit, font_size);
    }
}

static void _ssd1306_show_signed(OledDisplay *self, int16_t x, int16_t y,
                                 int32_t num, uint8_t length, uint8_t font_size)
{
    uint32_t num1;
    if (num >= 0) {
        _ssd1306_show_char(self, x, y, '+', font_size);
        num1 = (uint32_t)num;
    } else {
        _ssd1306_show_char(self, x, y, '-', font_size);
        num1 = (uint32_t)(-num);
    }
    for (uint8_t i = 0; i < length; i++) {
        char digit = (char)(num1 / oled_pow(10, length - i - 1) % 10 + '0');
        _ssd1306_show_char(self, x + (i + 1) * font_size, y, digit, font_size);
    }
}

static void _ssd1306_show_hex(OledDisplay *self, int16_t x, int16_t y,
                              uint32_t num, uint8_t length, uint8_t font_size)
{
    for (uint8_t i = 0; i < length; i++) {
        uint8_t single = num / oled_pow(16, length - i - 1) % 16;
        char digit = (single < 10) ? (char)(single + '0')
                                   : (char)(single - 10 + 'A');
        _ssd1306_show_char(self, x + i * font_size, y, digit, font_size);
    }
}

static void _ssd1306_show_bin(OledDisplay *self, int16_t x, int16_t y,
                              uint32_t num, uint8_t length, uint8_t font_size)
{
    for (uint8_t i = 0; i < length; i++) {
        char digit = (char)(num / oled_pow(2, length - i - 1) % 2 + '0');
        _ssd1306_show_char(self, x + i * font_size, y, digit, font_size);
    }
}

static void _ssd1306_show_float(OledDisplay *self, int16_t x, int16_t y,
                                double num, uint8_t int_len, uint8_t frac_len,
                                uint8_t font_size)
{
    uint32_t pow_num, int_num, frac_num;

    if (num >= 0) {
        _ssd1306_show_char(self, x, y, '+', font_size);
    } else {
        _ssd1306_show_char(self, x, y, '-', font_size);
        num = -num;
    }

    int_num = (uint32_t)num;
    num -= int_num;
    pow_num = oled_pow(10, frac_len);
    frac_num = (uint32_t)(num * pow_num + 0.5); /* 四舍五入 */
    int_num += frac_num / pow_num;

    _ssd1306_show_num(self, x + font_size, y, int_num, int_len, font_size);
    _ssd1306_show_char(self, x + (int_len + 1) * font_size, y, '.', font_size);
    _ssd1306_show_num(self, x + (int_len + 2) * font_size, y, frac_num, frac_len, font_size);
}

