loliweive/stm32-oop/src/display/ssd1306.c
/* ── 格式化输出 ──────────────────────────────────────── */

void oled_printf(OledDisplay *self, int16_t x, int16_t y,
                 uint8_t font_size, const char *fmt, ...)
{
    char str[256];
    va_list arg;
    va_start(arg, fmt);
    vsnprintf(str, sizeof(str), fmt, arg);
    va_end(arg);
    _ssd1306_show_string(self, x, y, str, font_size);
}

/* ═══════════════════════════════════════════════════════
 * vtable 定义
 * ═══════════════════════════════════════════════════════ */

static const OledVtable _ssd1306_vtable = {
    /* 硬件控制 */
    .init         = _ssd1306_init,
    .clear        = _ssd1306_clear,
    .flush        = _ssd1306_flush,
    .flush_area   = _ssd1306_flush_area,
    .reverse      = _ssd1306_reverse,
    .reverse_area = _ssd1306_reverse_area,

    /* 像素操作 */
    .draw_point   = _ssd1306_draw_point,
    .get_point    = _ssd1306_get_point,

    /* 几何绘图 */
    .draw_line    = _ssd1306_draw_line,
    .draw_rect    = _ssd1306_draw_rect,
    .draw_triangle = _ssd1306_draw_triangle,
    .draw_circle  = _ssd1306_draw_circle,
    .draw_ellipse = _ssd1306_draw_ellipse,
    .draw_arc     = _ssd1306_draw_arc,

    /* 文本显示 */
    .show_char    = _ssd1306_show_char,
    .show_string  = _ssd1306_show_string,
    .show_num     = _ssd1306_show_num,
    .show_signed  = _ssd1306_show_signed,
    .show_hex     = _ssd1306_show_hex,
    .show_bin     = _ssd1306_show_bin,
    .show_float   = _ssd1306_show_float,
    .show_image   = _ssd1306_show_image,

    /* 格式化输出 */
    /* NOTE: varargs 不能通过函数指针安全调用 (C 标准未定义行为)。
       oled_printf 是独立函数，直接调用 ssd1306 内部实现。
       此槽位故意为 NULL — 应使用 oled_printf() 而非 vtable->printf() */
    .printf       = NULL,
};

/* ═══════════════════════════════════════════════════════
 * 构造函数
 * ═══════════════════════════════════════════════════════ */

void ssd1306_ctor(SSD1306 *self, void *i2c, uint8_t addr)
{
    self->base.vtable = &_ssd1306_vtable;
    self->i2c  = i2c;
    self->addr = addr;
    memset(self->framebuf, 0, sizeof(self->framebuf));
}
